/*Напишете програма на С, която съдържа 3 функции,
изнесете прототипите им в отделен .h файл.
1. Първата функция да калкулира най-малко общо кратно на две положителни
числа.
2. Втората функция връща абсолютна стойност на числата (положителната
стойност на числата).
a. Трябва да може да приеме като параметър float и да върне float.
b. Тествайте с инт и float.
3. Напишете функция, която калкулира корен квадратен от число.
a. Проверете дали резултатът е отрицателно число и върнете -1.
b. Използвайте втората си функция, за да обърнете числото в положително и
да намерите корен квадратен от него. */
#include <stdio.h>
#include "f.h"
int main(){
    unsigned int a,b;
    float c,d;
    printf("NOK of A = ");
    scanf("%d",&a);
    printf("and B = ");
    scanf("%d",&b);
    printf("nok = %d\n",nok(a,b));
    printf("Absolute value of C = ");
    scanf("%f",&c);
    printf("%lf\n",fAbs(c));
    printf("Square root of D = ");
    scanf("%f",&d);
    printf("%lf\n",squareRoot(d));
    return 0;
}