/*Задача 10.
Да намерим простите числа до 1000 и да ги сложим в масив.
Да напишем функция, която да ни казва дали дадено число от 0 - до 1000
е просто.
Просто число е се нарича всяко естествено число, по-голямо от 1,
което има точно два естествени делителя – 1 и самото себе си.
Например 5 е просто, защото се дели единствено на 1 и 5, докато 6 не
е, защото се дели освен на 1 и 6, и на 2 и 3.*/
#include <stdio.h>
int isPrime(int n){
    if(n<2){
        return 0;
    }
    for (int i = 2; i <= n / 2; ++i) {

        if (n % i == 0) {
            return 0;
        }
    }
    return 1;
}
int main(){
    int arr[1000];
    for(int n=0, i=0; n<1000;n++){
        if(isPrime(n)==1){
            arr[i]=n;            
            printf("a[%d] = %d\n",i,arr[i]);\
            i++;
        }
    }
    return 0;
}