/*Напишете функцията int atof(char *s), която
преобразува стринг в число с десетична запетая. Тази функция е
подобна на разглежданата по-горе atoi(char *s), само че когато се
стигне до . точката, отделяща цялата част от дробната, трябва
да се пусне още един цикъл, който да изчисли числото в
дробната част по същия начин, както е числото в цялата част.
Само че тук при дробната част трябва да имаме една
променлива, която да умножаваме по 10 всеки път до края на
дробната част power *= 10; Накрая трябва да разделим
полученото число на тази променлива, за да получим реалното
число с плаващата заперая на точното място. */
#include <stdio.h>
double atof(char *s);
int main()
{
    char s[] = "123.456";
    double rez;
    rez = atof(s);
    printf("The number in the string is: %lf", rez);
    return 0;
}
double atof(char *s)
{
    double n = 0, d = 0, power = 1.0;
    int i;
    for (i = 0; (s[i] >= '0' && s[i] <= '9') && s[i] != '.'; i++)
    {
        n = n * 10 + (s[i] - '0');
    }
    for (i = i + 1; (s[i] >= '0' && s[i] <= '9') && s[i] != '\0'; i++)
    {
        d = d * 10 + (s[i] - '0');
        power *= 10;
    }
    d=d/power;
    return n+d;
}