/*Задача 5*. Напишете програма, която генерира “случайна разходка” из
елементите на двумерен масив от тип char с размер 10 х 10. Преди разходката
всички елементи на масива съдържат символа ‘.’ и след като елемента е
посетен в него се записва поредната буква от латинската азбука т.е. на първия
посетен елемент се записва буквата ‘А’, а нз последния буквата ‘Z’. Програмата
трябва да се разхожда от елемент на елемент в следната последователност:
от елемента, на който е в момента може да се премести един елемент на горе(i-1),
на долу(i+1), на ляво(j-1) или на дясно(j+1). Не може да се премества на произволна
позиция. Преди всяко преместване проверете дали няма да излезете извън
масива и дали позицията вече не е заета от някоя буква т.е. елемента да е
посетен вече. Ако горните условия са изпълнени се преместете в желатана
посока. Ако всичките 4 дестинации са блокирани вашата програм трябва да
спре.
Подсказка: Използвайте функциите srand() и rand() за да генерирате случайните числа.
 Използвайте int n = rand() % 4; за да генерирате числа от 1 до 4 */
 #include <stdio.h>
 int main(){
    char arr[10][10]={{'.'},{'.'}};
    for(int i=0; i<10; i++){
            for(int j=0; j<10; j++){
                arr[i][j]='.';
                printf("%c",arr[i][j]);
            }
            printf("\n");
        }
    char c = 'A';
    int m,i=0,j=0;
    while(c<='Z'){
        if(arr[i][j]=='.'){ // дали позицията вече не е заета от някоя буква т.е. елемента да епосетен вече.*/ 
        arr[i][j]=c;
        c++;
        } 
        if((arr[i-1][j]!='.')&&(arr[i+1][j]!='.')&&(arr[i][j-1]!='.')&&(arr[i][j+1]!='.')){ 
            printf("No way the last symbol is %c\n", c-1);
            /* Ако всичките 4 дестинации са блокирани вашата програм трябва да спре.*/
            break;
        }
        m=rand()%4;
        switch (m){
        case 0: {
            i=i-1;
            if((i>=0 && i<10) && (arr[i][j]=='.')){ /* Преди всяко преместване проверете дали няма да излезете извън масива*/
               
            } else {
                i++;
                }
            break;
            }
        case 1: {
            i=i+1;
            if((i>=0 && i<10) && (arr[i][j]=='.')){
               
            } else {
                i--;
                }
            break;
            }
        case 2: {
            j=j-1;
            if((j>=0 && j<10) && (arr[i][j]=='.')){
                
            } else {
                j++;
                }
            break;
            }
        case 3:{
            j=j+1;
            if((j>=0 && j<10) && (arr[i][j]=='.')){
                
            } else {
                j--;
                }
            break;
            }
        }
        
        
    }
     for(int i=0; i<10; i++){
            for(int j=0; j<10; j++){
                printf("%c ",arr[i][j]);
            }
            printf("\n");
        }
    return 0;
 }

 /*
A D E . . J K . . .
B C F G H I L . . . 
. . . P O N M . . .
. . . Q R S T U V .
. . . . . . . . W .
. . . . . . . . X .
. . . . . . . . Y Z
. . . . . . . . . . 
. . . . . . . . . .
. . . . . . . . . . 
*/