/*Задача 2. Дефинирайте и инициализирайте двумерен масив с по 5
елемента (5 x 5). След като сте готови, направете въвеждане на данните в
масива, като четете от потребителя със scanf.
Задача 13. - 2021.02.05 Дефинирайте и инициализирайте двумерен масив с по 5
елемента (5 x 5). След като сте готови, направете въвеждане на данните в
масива, като четете от потребителя със scanf.*/
#include <stdio.h>
int main(){
    int arr[5][5]={{0},{0}};
    printf("Enter 25 elements:\n");
    for(int i=0; i<5; i++){
        for(int j=0; j<5; j++){
            printf("arr [%d] [%d]: ",i,j);
            scanf("%d",&arr[i][j]);
        }
    }
    printf("arr 5x5 elements:\n");
    for(int i=0; i<5; i++){
            for(int j=0; j<5; j++){
                printf("%d\t",arr[i][j]);
            }
            printf("\n");
        }
    
    return 0;
}