/*Задача 1. Дефинирайте и инициализирайте едномерен масив с 5
елемента. След като сте готови, направете въвеждане на данните в
масива, като четете от потребителя със scanf.
Задача 12.- 2021.02.05 Дефинирайте и инициализирайте едномерен масив с 5
елемента. Следкато сте готови, направете въвеждане на данните в масива,
като четете от потребителя със scanf.*/
#include <stdio.h>
int main(){
    int arr[5]={0};
    printf("Enter 5 elements:\n");
    for(int i=0; i<5; i++){
        printf("arr [%d]: ",i);
        scanf("%d",&arr[i]);
    }
    printf("The elements in the array are:\n");
    for(int i=0; i<5; i++){
        printf("%d\t",arr[i]);
    }
    return 0;
}
