/*Задача 19 Дефинирайте 2 масива с по 10 елемента, А и В, напълнете ги
със случайни числа от 0 до 20, умножете всеки от елементите А[i]*В[i] и
напишете резултата на екрана.
Вариация: Модифицирайте така, че да извежда резултат от целочислено
деление. (Каква проверка трябва да направите?)*/
/*Използвайте int n = rand() % 4; за да генерирате числа от 1 до 4 */
#include <stdio.h>
int main(){
    int a[10], b[10];
    for(int i=0; i<10; i++){
        a[i] = rand()%20;
        b[i] = rand()%20;
        printf("a[%d] = %d\t b[%d] = %d\t %d*%d=%d\n",i,a[i],i,b[i],a[i],b[i],a[i]*b[i]);
        
    }
    printf("\n");
    for(int i=0; i<10; i++){
        if(b[i]!=0){
        printf("a[%d] = %d\t b[%d] = %d\t %d/%d=%d\n",i,a[i],i,b[i],a[i],b[i],a[i]/b[i]);
        } else {
            printf("a[%d] = %d\t b[%d] = %d\n",i,a[i],i,b[i],a[i],b[i]);
        }
    }
    return 0;
}