/*Задача 7. Дефинирайте масив int с 10 елемента. Дефинирайте
пойнтер, който ще сочи към масива. Насочете пойнтера към масива. Нужно
ли е да използвате &? Какво представлява името на масива? Какво сочи?
Колко начина има за да изпишете насочването на пойнтера към масива.
Има ли разлика между тях?*/
#include <stdio.h>
int main(){
    int arr[10]={23,1,2,3,4,5,6,7,8,9};
    int *a;
    a=&arr[0];
    printf("arr[0] = %d, *a = %d, a (hex) = %0x\n", arr[0], *a, a);
    int arr2[10]={12,1,2,3,4,5,6,7,8,9};
    int *b;
    b=arr2; /* може и без & */
    printf("arr2[0] = %d, *b = %d, b (hex) = %0x\n", arr2[0], *b, b);
    return 0;
}