/*от слайд 15:
Първата функция strcpy(s, t), която копира низа t в низа s. Щеше да е
чудесно просто да кажем s = t, но по този начин ще копираме указателите, а
не всички символи от единия в другия масив. За да стане това трябва да
обходим целия масив символ по символ и като използваме цикъл и да
присвоим стойността всеки един елемент от единия масив на същата
позиция в другия.
Задача 6.Опитайте да го направите сами:

}*/
#include <stdio.h>
#include <string.h>
void strcpyNew(char *s, char *t){
    int i=9, j=0;
    for(i=0, j=0; i<strlen(t); i++, j++){
        s[j]=t[i];
    }
    s[j]='\0';
}
int main(){
    char s1[]="LONG STRING";
    char s2[]="string";
    strcpyNew(s1,s2);
    printf("strcpyNew:\n");
    printf("s1: %s\n",s1);
    printf("s2: %s\n",s2);
        
    return 0;
}
