/*Задача 5.
Дефинирайте и инициализирайте int променлива = 34 и
пойнтер към нея.
Опитайте да ги разместите, като поредност (първо да е
пойнтерът, после променливата).*/
#include <stdio.h>
int main(){
    int *p;/*=&a не работи защото я декларираме след пойнтера*/
    int a=34;
    p=&a;
    printf("%d value %d address\n",*p,p);
    return 0;
}