/*Задача 8.
Дефинирайте и инициализирайте променлива и пойнтер
към нея. Отпечатайте адреса на пойнтера с %p с printf.*/
#include <stdio.h>
int main(){
    int a=3;
    int *p=&a;
    printf("%p",p); /*000000000061FE14*/
    return 0;
}