/*Задача 10.
Как работи? Дефинираме променлива “а“, дефинираме
пойнтер, но още не му задаваме стойност. Отпечатайте
адреса на “а”. След това присвояваме стойност на
пойнтера, като внимаваме типовете на пойнтера и
променливата да са от един и същи тип. Отпечатваме
на екрана стойността на пойнтера с %р, стойността на
„а“ с %d, стойността на *ptr с %d.*/
#include <stdio.h>
int main(){
    int a=0;
    int *p;
    printf("&a = %p\n",&a); /* 61FE1C, %d извежда 6422044 */
    *p=10;
    printf("p = %p\n",&p); /*%p позволява извеждане на адрес, но не и извеждане на стойност */
    printf("a = %d\n",a);
    printf("*p = %d",*p);
    return 0;
}