/*Задача 7.
Направете програма, в която инициализирате пойнтер към
променлива и след това изчислявате сбор на променливата
(използвайки пойнтера) + 5. Отпечатайте на екрана.*/
#include <stdio.h>
int main(){
    int a=6;
    int *p=&a;
    *p+=5;
    printf("%d",a); /*11*/
    return 0;
}