/*Задача 13.
Напишете програма, която да намери общия брой на
редовете в текстови файл.
Създайте файл, който съдържа няколко реда текст.
Внимавайте къде позиционирате файла.
Отворете файла. Използвайте променлива, която да
брои броя на редовете.*/
#include <stdio.h>
int main(){
    FILE *fp=NULL;
    fp=fopen("13.txt","rt");
    int count=1;
    char c;
    while((c=getc(fp))!=EOF){
        if(c=='\n'){
            count++;
        }
    }
    printf("%d",count);
    fclose(fp);
    return 0;
}