/*Задача 9.
Напишете текст с форматиращ параметър.
int fprint(FILE* stream, const char *forma…);
Първият параметър е файл стрийм, вторият е
форматиращият знак, следван от броя му и т.н.
Форматиращият знак може да е спейс, спецификатор и
т. н.
При успешно изпълнение функцията връща броя на
записаните символи, при грешка връща негативна
стойност.*/
#include <stdio.h>
int main(){
    FILE *fp=NULL;
    fp=fopen("9.txt","wt");
    fprintf(fp,"%s %s %d","fprintf","task",9);
    fclose(fp);
    return 0;
}